Modul7/app/Controllers/Auth.php

SELECT *
FROM `user`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function processLogin()
    {
        helper(['form']);
        $session = session();
        $userModel = new UserModel();

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $userModel->where('username', $username)->first();