Modul7/app/Controllers/Buku.php

    public function index()
    {
        $this->checkLogin();

        $data['buku'] = $this->bukuModel->findAll();
---
SELECT *
FROM `buku`

            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $this->bukuModel->save([
            'judul' => $this->request->getPost('judul'),
            'penulis' => $this->request->getPost('penulis'),
            'penerbit' => $this->request->getPost('penerbit'),
            'tahun_terbit' => $this->request->getPost('tahun_terbit'),
        ]);
---
INSERT INTO `buku` (`judul`, `penulis`, `penerbit`, `tahun_terbit`) VALUES ('Lookism', 'PTJ', 'PTJ', '2014')

    public function edit($id)
    {
        $this->checkLogin();

        $data['buku'] = $this->bukuModel->find($id);
---
SELECT *
FROM `buku`
WHERE `buku`.`id` = '3'

    public function update($id)
    {
        $this->checkLogin();

        $rules = [
            'judul' => 'required|string',
            'penulis' => 'required|string',
            'penerbit' => 'required|string',
            'tahun_terbit' => 'required|integer|greater_than[1800]|less_than[2024]',
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $this->bukuModel->update($id, [
            'judul' => $this->request->getPost('judul'),
            'penulis' => $this->request->getPost('penulis'),
            'penerbit' => $this->request->getPost('penerbit'),
            'tahun_terbit' => $this->request->getPost('tahun_terbit'),
        ]);
---
UPDATE `buku` SET `judul` = 'Record Of Ragnarok', `penulis` = 'Nazmi Hakim', `penerbit` = 'Hakim Nazmi', `tahun_terbit` = '2022'
WHERE `buku`.`id` IN ('3')

    public function delete($id)
    {
        $this->checkLogin();

        $this->bukuModel->delete($id);
---
DELETE FROM `buku`
WHERE `id` IN ('4')